bin/test/tsung.xml
<?xml version="1.0"?><!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd"><tsung loglevel="notice" version="1.0">	<clients>		<client host="iZ23a3vedmvZ" use_controller_vm="false" maxusers="100000"></client>		<!--<client host="localhost" use_controller_vm="false" maxusers="100000"></client>-->		<!--<client host="localhost" use_controller_vm="false" maxusers="1000"></client>-->		<!--<client host="iZ23skerru2Z" use_controller_vm="false" maxusers="1000"></client>-->	</clients>	<!-- Server side setup -->	<servers>		<!--<server host="120.26.50.187" port="5222" type="tcp"></server>-->		<server host="101.37.99.150" port="5222" type="tcp"></server>		<!--<server host="192.168.1.66" port="5222" type="tcp"></server>-->		<!--<server host="192.168.31.87" port="5222" type="tcp"></server>-->	</servers>	<load>		<arrivalphase phase="1" duration="1" unit="hour">			<!-- <users interarrival="500" unit="second"></users> -->			<users maxnumber="200000" arrivalrate="3" unit="second"></users>		</arrivalphase>		<arrivalphase phase="2" duration="1" unit="hour">			<!-- <users interarrival="500" unit="second"></users> -->			<users maxnumber="200000" arrivalrate="2" unit="second"></users>		</arrivalphase>		<arrivalphase phase="3" duration="1" unit="hour">			<!-- <users interarrival="500" unit="second"></users> -->			<users maxnumber="200000" arrivalrate="3" unit="second"></users>		</arrivalphase>		<arrivalphase phase="4" duration="1" unit="hour">			<!-- <users interarrival="500" unit="second"></users> -->			<users maxnumber="200000" arrivalrate="2" unit="second"></users>		</arrivalphase>		<arrivalphase phase="5" duration="1" unit="hour">			<!-- <users interarrival="500" unit="second"></users> -->			<users maxnumber="200000" arrivalrate="3" unit="second"></users>		</arrivalphase>		<arrivalphase phase="6" duration="1" unit="hour">			<!-- <users interarrival="500" unit="second"></users> -->			<users maxnumber="200000" arrivalrate="2" unit="second"></users>		</arrivalphase>		<arrivalphase phase="7" duration="1" unit="hour">			<!-- <users interarrival="500" unit="second"></users> -->			<users maxnumber="200000" arrivalrate="3" unit="second"></users>		</arrivalphase>		<arrivalphase phase="8" duration="1" unit="hour">			<!-- <users interarrival="500" unit="second"></users> -->			<users maxnumber="200000" arrivalrate="2" unit="second"></users>		</arrivalphase>		<arrivalphase phase="9" duration="1" unit="hour">			<!-- <users interarrival="500" unit="second"></users> -->			<users maxnumber="200000" arrivalrate="3" unit="second"></users>		</arrivalphase>		<arrivalphase phase="10" duration="1" unit="hour">			<!-- <users interarrival="500" unit="second"></users> -->			<users maxnumber="200000" arrivalrate="2" unit="second"></users>		</arrivalphase>	</load>	<!-- JABBER parameters -->	<!-- to synchronise users, use a global acknoledgement -->	<options>		<option type="ts_jabber" name="global_number" value="100000"></option>		<option type="ts_jabber" name="userid_max" value="100000"></option>		<option type="ts_jabber" name="domain" value="youyi"></option>		<option type="ts_jabber" name="username" value="xsung"></option>		<option type="ts_jabber" name="passwd" value="xsung"></option>		<option type="ts_jabber" name="muc_service" value="conference.youyi"/>		<!-- full name of the MUC component -->	</options>	<!--120.26.50.187-->	<sessions>		<session bidi="true" probability="10" name="jabber-muc-10171" type="ts_jabber">			<request>				<jabber type="connect" ack="no_ack"></jabber>			</request>			<thinktime value="2"></thinktime>			<transaction name="authenticate">				<request>					<jabber type="auth_get" ack="local"></jabber>				</request>				<request>					<jabber type="auth_set_plain" ack="local"></jabber>				</request>			</transaction>			<request>				<jabber type="presence:initial" ack="no_ack"/>			</request>			<thinktime value="2"></thinktime>			<transaction name="roster">				<request>					<jabber type="iq:roster:get" ack="local"></jabber>				</request>			</transaction>			<thinktime value="2"></thinktime>			<setdynvars sourcetype="random_string" length="10">				<var name="nick1"/>			</setdynvars>			<!-- join an existing room or create a new one -->			<request subst="true">				<jabber type='muc:join' ack="local" room="10171" nick="nickJoin%%_nick1%%"/>			</request>			<for from="1" to="4000" var="i">				<thinktime value="5"/>				<transaction name="online_chat">					<request subst="true">						<jabber type="muc:chat" ack="no_ack" size="16" room="10171"/>					</request>				</transaction>			</for>		</session>		<session bidi="true" probability="10" name="jabber-muc-10177" type="ts_jabber">			<request>				<jabber type="connect" ack="no_ack"></jabber>			</request>			<thinktime value="2"></thinktime>			<transaction name="authenticate">				<request>					<jabber type="auth_get" ack="local"></jabber>				</request>				<request>					<jabber type="auth_set_plain" ack="local"></jabber>				</request>			</transaction>			<request>				<jabber type="presence:initial" ack="no_ack"/>			</request>			<thinktime value="2"></thinktime>			<transaction name="roster">				<request>					<jabber type="iq:roster:get" ack="local"></jabber>				</request>			</transaction>			<thinktime value="2"></thinktime>			<setdynvars sourcetype="random_string" length="10">				<var name="nick1"/>			</setdynvars>			<!-- join an existing room or create a new one -->			<request subst="true">				<jabber type='muc:join' ack="local" room="10177" nick="nickJoin%%_nick1%%"/>			</request>			<for from="1" to="4000" var="i">				<thinktime value="5"/>				<transaction name="online_chat">					<request subst="true">						<jabber type="muc:chat" ack="no_ack" size="16" room="10177"/>					</request>				</transaction>			</for>		</session>		<session bidi="true" probability="10" name="jabber-muc-10179" type="ts_jabber">			<request>				<jabber type="connect" ack="no_ack"></jabber>			</request>			<thinktime value="2"></thinktime>			<transaction name="authenticate">				<request>					<jabber type="auth_get" ack="local"></jabber>				</request>				<request>					<jabber type="auth_set_plain" ack="local"></jabber>				</request>			</transaction>			<request>				<jabber type="presence:initial" ack="no_ack"/>			</request>			<thinktime value="2"></thinktime>			<transaction name="roster">				<request>					<jabber type="iq:roster:get" ack="local"></jabber>				</request>			</transaction>			<thinktime value="2"></thinktime>			<setdynvars sourcetype="random_string" length="10">				<var name="nick1"/>			</setdynvars>			<!-- join an existing room or create a new one -->			<request subst="true">				<jabber type='muc:join' ack="local" room="10179" nick="nickJoin%%_nick1%%"/>			</request>			<for from="1" to="4000" var="i">				<thinktime value="5"/>				<transaction name="online_chat">					<request subst="true">						<jabber type="muc:chat" ack="no_ack" size="16" room="10179"/>					</request>				</transaction>			</for>		</session>		<session bidi="true" probability="10" name="jabber-muc-10181" type="ts_jabber">			<request>				<jabber type="connect" ack="no_ack"></jabber>			</request>			<thinktime value="2"></thinktime>			<transaction name="authenticate">				<request>					<jabber type="auth_get" ack="local"></jabber>				</request>				<request>					<jabber type="auth_set_plain" ack="local"></jabber>				</request>			</transaction>			<request>				<jabber type="presence:initial" ack="no_ack"/>			</request>			<thinktime value="2"></thinktime>			<transaction name="roster">				<request>					<jabber type="iq:roster:get" ack="local"></jabber>				</request>			</transaction>			<thinktime value="2"></thinktime>			<setdynvars sourcetype="random_string" length="10">				<var name="nick1"/>			</setdynvars>			<!-- join an existing room or create a new one -->			<request subst="true">				<jabber type='muc:join' ack="local" room="10181" nick="nickJoin%%_nick1%%"/>			</request>			<for from="1" to="4000" var="i">				<thinktime value="5"/>				<transaction name="online_chat">					<request subst="true">						<jabber type="muc:chat" ack="no_ack" size="16" room="10181"/>					</request>				</transaction>			</for>		</session>		<session bidi="true" probability="10" name="jabber-muc-10196" type="ts_jabber">			<request>				<jabber type="connect" ack="no_ack"></jabber>			</request>			<thinktime value="2"></thinktime>			<transaction name="authenticate">				<request>					<jabber type="auth_get" ack="local"></jabber>				</request>				<request>					<jabber type="auth_set_plain" ack="local"></jabber>				</request>			</transaction>			<request>				<jabber type="presence:initial" ack="no_ack"/>			</request>			<thinktime value="2"></thinktime>			<transaction name="roster">				<request>					<jabber type="iq:roster:get" ack="local"></jabber>				</request>			</transaction>			<thinktime value="2"></thinktime>			<setdynvars sourcetype="random_string" length="10">				<var name="nick1"/>			</setdynvars>			<!-- join an existing room or create a new one -->			<request subst="true">				<jabber type='muc:join' ack="local" room="10196" nick="nickJoin%%_nick1%%"/>			</request>			<for from="1" to="4000" var="i">				<thinktime value="5"/>				<transaction name="online_chat">					<request subst="true">						<jabber type="muc:chat" ack="no_ack" size="16" room="10196"/>					</request>				</transaction>			</for>		</session>		<session bidi="true" probability="10" name="jabber-muc-10217" type="ts_jabber">			<request>				<jabber type="connect" ack="no_ack"></jabber>			</request>			<thinktime value="2"></thinktime>			<transaction name="authenticate">				<request>					<jabber type="auth_get" ack="local"></jabber>				</request>				<request>					<jabber type="auth_set_plain" ack="local"></jabber>				</request>			</transaction>			<request>				<jabber type="presence:initial" ack="no_ack"/>			</request>			<thinktime value="2"></thinktime>			<transaction name="roster">				<request>					<jabber type="iq:roster:get" ack="local"></jabber>				</request>			</transaction>			<thinktime value="2"></thinktime>			<setdynvars sourcetype="random_string" length="10">				<var name="nick1"/>			</setdynvars>			<!-- join an existing room or create a new one -->			<request subst="true">				<jabber type='muc:join' ack="local" room="10217" nick="nickJoin%%_nick1%%"/>			</request>			<for from="1" to="4000" var="i">				<thinktime value="5"/>				<transaction name="online_chat">					<request subst="true">						<jabber type="muc:chat" ack="no_ack" size="16" room="10217"/>					</request>				</transaction>			</for>		</session>		<session bidi="true" probability="10" name="jabber-muc-11069" type="ts_jabber">			<request>				<jabber type="connect" ack="no_ack"></jabber>			</request>			<thinktime value="2"></thinktime>			<transaction name="authenticate">				<request>					<jabber type="auth_get" ack="local"></jabber>				</request>				<request>					<jabber type="auth_set_plain" ack="local"></jabber>				</request>			</transaction>			<request>				<jabber type="presence:initial" ack="no_ack"/>			</request>			<thinktime value="2"></thinktime>			<transaction name="roster">				<request>					<jabber type="iq:roster:get" ack="local"></jabber>				</request>			</transaction>			<thinktime value="2"></thinktime>			<setdynvars sourcetype="random_string" length="10">				<var name="nick1"/>			</setdynvars>			<!-- join an existing room or create a new one -->			<request subst="true">				<jabber type='muc:join' ack="local" room="11069" nick="nickJoin%%_nick1%%"/>			</request>			<for from="1" to="4000" var="i">				<thinktime value="5"/>				<transaction name="online_chat">					<request subst="true">						<jabber type="muc:chat" ack="no_ack" size="16" room="11069"/>					</request>				</transaction>			</for>		</session>		<session bidi="true" probability="10" name="jabber-muc-11205" type="ts_jabber">			<request>				<jabber type="connect" ack="no_ack"></jabber>			</request>			<thinktime value="2"></thinktime>			<transaction name="authenticate">				<request>					<jabber type="auth_get" ack="local"></jabber>				</request>				<request>					<jabber type="auth_set_plain" ack="local"></jabber>				</request>			</transaction>			<request>				<jabber type="presence:initial" ack="no_ack"/>			</request>			<thinktime value="2"></thinktime>			<transaction name="roster">				<request>					<jabber type="iq:roster:get" ack="local"></jabber>				</request>			</transaction>			<thinktime value="2"></thinktime>			<setdynvars sourcetype="random_string" length="10">				<var name="nick1"/>			</setdynvars>			<!-- join an existing room or create a new one -->			<request subst="true">				<jabber type='muc:join' ack="local" room="11205" nick="nickJoin%%_nick1%%"/>			</request>			<for from="1" to="4000" var="i">				<thinktime value="5"/>				<transaction name="online_chat">					<request subst="true">						<jabber type="muc:chat" ack="no_ack" size="16" room="11205"/>					</request>				</transaction>			</for>		</session>		<session bidi="true" probability="10" name="jabber-muc-11324" type="ts_jabber">			<request>				<jabber type="connect" ack="no_ack"></jabber>			</request>			<thinktime value="2"></thinktime>			<transaction name="authenticate">				<request>					<jabber type="auth_get" ack="local"></jabber>				</request>				<request>					<jabber type="auth_set_plain" ack="local"></jabber>				</request>			</transaction>			<request>				<jabber type="presence:initial" ack="no_ack"/>			</request>			<thinktime value="2"></thinktime>			<transaction name="roster">				<request>					<jabber type="iq:roster:get" ack="local"></jabber>				</request>			</transaction>			<thinktime value="2"></thinktime>			<setdynvars sourcetype="random_string" length="10">				<var name="nick1"/>			</setdynvars>			<!-- join an existing room or create a new one -->			<request subst="true">				<jabber type='muc:join' ack="local" room="11324" nick="nickJoin%%_nick1%%"/>			</request>			<for from="1" to="4000" var="i">				<thinktime value="5"/>				<transaction name="online_chat">					<request subst="true">						<jabber type="muc:chat" ack="no_ack" size="16" room="11324"/>					</request>				</transaction>			</for>		</session>		<session bidi="true" probability="10" name="jabber-muc-11347" type="ts_jabber">			<request>				<jabber type="connect" ack="no_ack"></jabber>			</request>			<thinktime value="2"></thinktime>			<transaction name="authenticate">				<request>					<jabber type="auth_get" ack="local"></jabber>				</request>				<request>					<jabber type="auth_set_plain" ack="local"></jabber>				</request>			</transaction>			<request>				<jabber type="presence:initial" ack="no_ack"/>			</request>			<thinktime value="2"></thinktime>			<transaction name="roster">				<request>					<jabber type="iq:roster:get" ack="local"></jabber>				</request>			</transaction>			<thinktime value="2"></thinktime>			<setdynvars sourcetype="random_string" length="10">				<var name="nick1"/>			</setdynvars>			<!-- join an existing room or create a new one -->			<request subst="true">				<jabber type='muc:join' ack="local" room="11347" nick="nickJoin%%_nick1%%"/>			</request>			<for from="1" to="4000" var="i">				<thinktime value="5"/>				<transaction name="online_chat">					<request subst="true">						<jabber type="muc:chat" ack="no_ack" size="16" room="11347"/>					</request>				</transaction>			</for>		</session>	</sessions>	<!--114.55.87.62-->	<!--<sessions>-->		<!--<session bidi="true" probability="10" name="jabber-muc-10108" type="ts_jabber">-->			<!--<request>-->				<!--<jabber type="connect" ack="no_ack"></jabber>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="authenticate">-->				<!--<request>-->					<!--<jabber type="auth_get" ack="local"></jabber>-->				<!--</request>-->				<!--<request>-->					<!--<jabber type="auth_set_plain" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<request>-->				<!--<jabber type="presence:initial" ack="no_ack"/>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="roster">-->				<!--<request>-->					<!--<jabber type="iq:roster:get" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<thinktime value="2"></thinktime>-->			<!--<setdynvars sourcetype="random_string" length="10">-->				<!--<var name="nick1"/>-->			<!--</setdynvars>-->			<!--&lt;!&ndash; join an existing room or create a new one &ndash;&gt;-->			<!--<request subst="true">-->				<!--<jabber type='muc:join' ack="local" room="10108" nick="nickJoin%%_nick1%%"/>-->			<!--</request>-->			<!--<for from="1" to="4000" var="i">-->				<!--<thinktime value="5"/>-->				<!--<transaction name="online_chat">-->					<!--<request subst="true">-->						<!--<jabber type="muc:chat" ack="no_ack" size="16" room="10108"/>-->					<!--</request>-->				<!--</transaction>-->			<!--</for>-->		<!--</session>-->		<!--<session bidi="true" probability="10" name="jabber-muc-10118" type="ts_jabber">-->			<!--<request>-->				<!--<jabber type="connect" ack="no_ack"></jabber>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="authenticate">-->				<!--<request>-->					<!--<jabber type="auth_get" ack="local"></jabber>-->				<!--</request>-->				<!--<request>-->					<!--<jabber type="auth_set_plain" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<request>-->				<!--<jabber type="presence:initial" ack="no_ack"/>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="roster">-->				<!--<request>-->					<!--<jabber type="iq:roster:get" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<thinktime value="2"></thinktime>-->			<!--<setdynvars sourcetype="random_string" length="10">-->				<!--<var name="nick1"/>-->			<!--</setdynvars>-->			<!--&lt;!&ndash; join an existing room or create a new one &ndash;&gt;-->			<!--<request subst="true">-->				<!--<jabber type='muc:join' ack="local" room="10118" nick="nickJoin%%_nick1%%"/>-->			<!--</request>-->			<!--<for from="1" to="4000" var="i">-->				<!--<thinktime value="5"/>-->				<!--<transaction name="online_chat">-->					<!--<request subst="true">-->						<!--<jabber type="muc:chat" ack="no_ack" size="16" room="10118"/>-->					<!--</request>-->				<!--</transaction>-->			<!--</for>-->		<!--</session>-->		<!--<session bidi="true" probability="10" name="jabber-muc-10141" type="ts_jabber">-->			<!--<request>-->				<!--<jabber type="connect" ack="no_ack"></jabber>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="authenticate">-->				<!--<request>-->					<!--<jabber type="auth_get" ack="local"></jabber>-->				<!--</request>-->				<!--<request>-->					<!--<jabber type="auth_set_plain" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<request>-->				<!--<jabber type="presence:initial" ack="no_ack"/>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="roster">-->				<!--<request>-->					<!--<jabber type="iq:roster:get" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<thinktime value="2"></thinktime>-->			<!--<setdynvars sourcetype="random_string" length="10">-->				<!--<var name="nick1"/>-->			<!--</setdynvars>-->			<!--&lt;!&ndash; join an existing room or create a new one &ndash;&gt;-->			<!--<request subst="true">-->				<!--<jabber type='muc:join' ack="local" room="10141" nick="nickJoin%%_nick1%%"/>-->			<!--</request>-->			<!--<for from="1" to="4000" var="i">-->				<!--<thinktime value="5"/>-->				<!--<transaction name="online_chat">-->					<!--<request subst="true">-->						<!--<jabber type="muc:chat" ack="no_ack" size="16" room="10141"/>-->					<!--</request>-->				<!--</transaction>-->			<!--</for>-->		<!--</session>-->		<!--<session bidi="true" probability="10" name="jabber-muc-10143" type="ts_jabber">-->			<!--<request>-->				<!--<jabber type="connect" ack="no_ack"></jabber>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="authenticate">-->				<!--<request>-->					<!--<jabber type="auth_get" ack="local"></jabber>-->				<!--</request>-->				<!--<request>-->					<!--<jabber type="auth_set_plain" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<request>-->				<!--<jabber type="presence:initial" ack="no_ack"/>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="roster">-->				<!--<request>-->					<!--<jabber type="iq:roster:get" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<thinktime value="2"></thinktime>-->			<!--<setdynvars sourcetype="random_string" length="10">-->				<!--<var name="nick1"/>-->			<!--</setdynvars>-->			<!--&lt;!&ndash; join an existing room or create a new one &ndash;&gt;-->			<!--<request subst="true">-->				<!--<jabber type='muc:join' ack="local" room="10143" nick="nickJoin%%_nick1%%"/>-->			<!--</request>-->			<!--<for from="1" to="4000" var="i">-->				<!--<thinktime value="5"/>-->				<!--<transaction name="online_chat">-->					<!--<request subst="true">-->						<!--<jabber type="muc:chat" ack="no_ack" size="16" room="10143"/>-->					<!--</request>-->				<!--</transaction>-->			<!--</for>-->		<!--</session>-->		<!--<session bidi="true" probability="10" name="jabber-muc-10144" type="ts_jabber">-->			<!--<request>-->				<!--<jabber type="connect" ack="no_ack"></jabber>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="authenticate">-->				<!--<request>-->					<!--<jabber type="auth_get" ack="local"></jabber>-->				<!--</request>-->				<!--<request>-->					<!--<jabber type="auth_set_plain" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<request>-->				<!--<jabber type="presence:initial" ack="no_ack"/>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="roster">-->				<!--<request>-->					<!--<jabber type="iq:roster:get" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<thinktime value="2"></thinktime>-->			<!--<setdynvars sourcetype="random_string" length="10">-->				<!--<var name="nick1"/>-->			<!--</setdynvars>-->			<!--&lt;!&ndash; join an existing room or create a new one &ndash;&gt;-->			<!--<request subst="true">-->				<!--<jabber type='muc:join' ack="local" room="10144" nick="nickJoin%%_nick1%%"/>-->			<!--</request>-->			<!--<for from="1" to="4000" var="i">-->				<!--<thinktime value="5"/>-->				<!--<transaction name="online_chat">-->					<!--<request subst="true">-->						<!--<jabber type="muc:chat" ack="no_ack" size="16" room="10144"/>-->					<!--</request>-->				<!--</transaction>-->			<!--</for>-->		<!--</session>-->		<!--<session bidi="true" probability="10" name="jabber-muc-10155" type="ts_jabber">-->			<!--<request>-->				<!--<jabber type="connect" ack="no_ack"></jabber>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="authenticate">-->				<!--<request>-->					<!--<jabber type="auth_get" ack="local"></jabber>-->				<!--</request>-->				<!--<request>-->					<!--<jabber type="auth_set_plain" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<request>-->				<!--<jabber type="presence:initial" ack="no_ack"/>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="roster">-->				<!--<request>-->					<!--<jabber type="iq:roster:get" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<thinktime value="2"></thinktime>-->			<!--<setdynvars sourcetype="random_string" length="10">-->				<!--<var name="nick1"/>-->			<!--</setdynvars>-->			<!--&lt;!&ndash; join an existing room or create a new one &ndash;&gt;-->			<!--<request subst="true">-->				<!--<jabber type='muc:join' ack="local" room="10155" nick="nickJoin%%_nick1%%"/>-->			<!--</request>-->			<!--<for from="1" to="4000" var="i">-->				<!--<thinktime value="5"/>-->				<!--<transaction name="online_chat">-->					<!--<request subst="true">-->						<!--<jabber type="muc:chat" ack="no_ack" size="16" room="10155"/>-->					<!--</request>-->				<!--</transaction>-->			<!--</for>-->		<!--</session>-->		<!--<session bidi="true" probability="10" name="jabber-muc-10158" type="ts_jabber">-->			<!--<request>-->				<!--<jabber type="connect" ack="no_ack"></jabber>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="authenticate">-->				<!--<request>-->					<!--<jabber type="auth_get" ack="local"></jabber>-->				<!--</request>-->				<!--<request>-->					<!--<jabber type="auth_set_plain" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<request>-->				<!--<jabber type="presence:initial" ack="no_ack"/>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="roster">-->				<!--<request>-->					<!--<jabber type="iq:roster:get" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<thinktime value="2"></thinktime>-->			<!--<setdynvars sourcetype="random_string" length="10">-->				<!--<var name="nick1"/>-->			<!--</setdynvars>-->			<!--&lt;!&ndash; join an existing room or create a new one &ndash;&gt;-->			<!--<request subst="true">-->				<!--<jabber type='muc:join' ack="local" room="10158" nick="nickJoin%%_nick1%%"/>-->			<!--</request>-->			<!--<for from="1" to="4000" var="i">-->				<!--<thinktime value="5"/>-->				<!--<transaction name="online_chat">-->					<!--<request subst="true">-->						<!--<jabber type="muc:chat" ack="no_ack" size="16" room="10158"/>-->					<!--</request>-->				<!--</transaction>-->			<!--</for>-->		<!--</session>-->		<!--<session bidi="true" probability="10" name="jabber-muc-10159" type="ts_jabber">-->			<!--<request>-->				<!--<jabber type="connect" ack="no_ack"></jabber>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="authenticate">-->				<!--<request>-->					<!--<jabber type="auth_get" ack="local"></jabber>-->				<!--</request>-->				<!--<request>-->					<!--<jabber type="auth_set_plain" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<request>-->				<!--<jabber type="presence:initial" ack="no_ack"/>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="roster">-->				<!--<request>-->					<!--<jabber type="iq:roster:get" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<thinktime value="2"></thinktime>-->			<!--<setdynvars sourcetype="random_string" length="10">-->				<!--<var name="nick1"/>-->			<!--</setdynvars>-->			<!--&lt;!&ndash; join an existing room or create a new one &ndash;&gt;-->			<!--<request subst="true">-->				<!--<jabber type='muc:join' ack="local" room="10159" nick="nickJoin%%_nick1%%"/>-->			<!--</request>-->			<!--<for from="1" to="4000" var="i">-->				<!--<thinktime value="5"/>-->				<!--<transaction name="online_chat">-->					<!--<request subst="true">-->						<!--<jabber type="muc:chat" ack="no_ack" size="16" room="10159"/>-->					<!--</request>-->				<!--</transaction>-->			<!--</for>-->		<!--</session>-->		<!--<session bidi="true" probability="10" name="jabber-muc-10162" type="ts_jabber">-->			<!--<request>-->				<!--<jabber type="connect" ack="no_ack"></jabber>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="authenticate">-->				<!--<request>-->					<!--<jabber type="auth_get" ack="local"></jabber>-->				<!--</request>-->				<!--<request>-->					<!--<jabber type="auth_set_plain" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<request>-->				<!--<jabber type="presence:initial" ack="no_ack"/>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="roster">-->				<!--<request>-->					<!--<jabber type="iq:roster:get" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<thinktime value="2"></thinktime>-->			<!--<setdynvars sourcetype="random_string" length="10">-->				<!--<var name="nick1"/>-->			<!--</setdynvars>-->			<!--&lt;!&ndash; join an existing room or create a new one &ndash;&gt;-->			<!--<request subst="true">-->				<!--<jabber type='muc:join' ack="local" room="10162" nick="nickJoin%%_nick1%%"/>-->			<!--</request>-->			<!--<for from="1" to="4000" var="i">-->				<!--<thinktime value="5"/>-->				<!--<transaction name="online_chat">-->					<!--<request subst="true">-->						<!--<jabber type="muc:chat" ack="no_ack" size="16" room="10162"/>-->					<!--</request>-->				<!--</transaction>-->			<!--</for>-->		<!--</session>-->		<!--<session bidi="true" probability="10" name="jabber-muc-10163" type="ts_jabber">-->			<!--<request>-->				<!--<jabber type="connect" ack="no_ack"></jabber>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="authenticate">-->				<!--<request>-->					<!--<jabber type="auth_get" ack="local"></jabber>-->				<!--</request>-->				<!--<request>-->					<!--<jabber type="auth_set_plain" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<request>-->				<!--<jabber type="presence:initial" ack="no_ack"/>-->			<!--</request>-->			<!--<thinktime value="2"></thinktime>-->			<!--<transaction name="roster">-->				<!--<request>-->					<!--<jabber type="iq:roster:get" ack="local"></jabber>-->				<!--</request>-->			<!--</transaction>-->			<!--<thinktime value="2"></thinktime>-->			<!--<setdynvars sourcetype="random_string" length="10">-->				<!--<var name="nick1"/>-->			<!--</setdynvars>-->			<!--&lt;!&ndash; join an existing room or create a new one &ndash;&gt;-->			<!--<request subst="true">-->				<!--<jabber type='muc:join' ack="local" room="10163" nick="nickJoin%%_nick1%%"/>-->			<!--</request>-->			<!--<for from="1" to="4000" var="i">-->				<!--<thinktime value="5"/>-->				<!--<transaction name="online_chat">-->					<!--<request subst="true">-->						<!--<jabber type="muc:chat" ack="no_ack" size="16" room="10163"/>-->					<!--</request>-->				<!--</transaction>-->			<!--</for>-->		<!--</session>-->	<!--</sessions>--></tsung>